Repository: NetizensKulawiakiApps4U/iMojeSDK
Catalog: iMojeSDK/Assets/Localizations/*.lproj/Localizable.strings
Languages: pl

# MISSING_MERCHANT_ID
source: Missing iMoje merchant id.
pl: Brakujące iMoje merchant id.

# INVALID_MERCHANT_ID
source: Invalid iMoje merchant id.
pl: Błędne iMoje merchant id.

# MISSING_SERVICE_ID
source: Missing iMoje service id.
pl: Brakujące iMoje service id.

# INVALID_SERVICE_ID
source: Invalid iMoje service id.
pl: Błędne iMoje service id.

# MISSING_SERVICE_KEY
source: Missing iMoje service key.
pl: Brakujące iMoje service key.

# INVALID_SERVICE_KEY
source: Invalid iMoje service key.
pl: Błędne iMoje service key.

# MISSING_ACCESS_TOKEN
source: Missing iMoje access token.
pl: Brakujące iMoje access token.

# INVALID_ACCESS_TOKEN
source: Invalid iMoje access token.
pl: Błędne iMoje access token.

source: Missing body payload.
pl: Brakujące body payload.

# UNKNOWN_RESPONSE_CODABLE
source: Cant parse response.
pl: Nie można przetworzyć odpowiedzi.

# VALIDATE_MISSING_FIELD_FMT
source: Missing field `%@`.
pl: Brakujące pole `%@`.

# VALIDATE_INVALID_FIELD_FMT
source: Invalid field `%@` with reason: %@.
pl: Brakujące pole `%@` with reason: %@.

source: Unknown error.
pl: Nieznany błąd.

# NO_DATA_ERROR
source: No data response.
pl: Brak danych w odpowiedzi.

source: Invalid response.
pl: Niepoprawna odpowiedź.

# CANT_CREATE_TRANSACTION_ERROR
source: Cant create transaction with action.
pl: Nie można zrealizować tranzakcji.

# INACTIVE_SERVICE_ERROR
source: Service is inactived.
pl: Serwis jest nieaktywny.

# EMPTY_PAYMENT_METHOD_CODE_ERROR
source: Empty payment method code.
pl: Brak kodu płatności.

# INFO_CREATE_TRANSACTION
source: Create transaction...
pl: Tworzenie tranzakcji...

# INFO_SUBMIT_TRANSACTION
source: Submit transaction...
pl: Zatwierdzanie tranzakcji...

# INFO_REDIRECT_TRANSACTION
source: Redirect transaction...
pl: Przekierowanie tranzakcji...

# INFO_COMPLETED_TRANSACTION
source: Completed transaction...
pl: Zakończenie tranzakcji...

# INFO_CLOSE
source: Close
pl: Zamknij

# INFO_ERROR
source: An Error Occured
pl: Błąd

# INFO_RETRY
source: Retry
pl: Ponów

# INFO_SUCCESS
source: Success
pl: Sukces

# INFO_FAILURE
source: Failure
pl: Błąd

# INFO_LOAD_SERVICE
source: Load service...
pl: Ładowanie serwisów...

# INFO_GREATER_THAN_ZERO
source: greater than 0
pl: większe niż 0

# INFO_INVALID_FORMAT
source: invalid format
pl: niepoprawny format

# INFO_TYPE_NOT_SUPPORTED_FOR_METHOD
source: `%@` type not supported for method `%@`
pl: `%@` typ nie jest wspierany przez metodę `%@`

# INFO_TYPE_IS_NOT_SUPPORTED
source: `%@` type is not supported
pl: `%@` nie jest wspierane

# INFO_METHOD_IS_NOT_SUPPORTED
source: method `%@` is not supported
pl: metoda `%@` nie jest wspierana

# INFO_UUID_V4_INVALID
source: string with hypens is not valid
pl: Text z załącznikami jest nieprawidłowy

# INFO_AMOUNT
source: Amount
pl: Kwota

# INFO_ORDER_ID
source: Order ID
pl: Numer zamówienia

# INFO_PAY
source: Pay
pl: Zapłać

# INFO_CUSTOMER
source: Customer
pl: Kupujący

# INFO_PAYMENT_FOR
source: Payment for
pl: Płatność dla

# INFO_POLICY
source: I declare that I have read and accepted %@.
pl: Oświadczam, że zapoznałem się i akceptuję %@.

# INFO_COOKIE
source: This site use cookies. By staying on website you accept %@.
pl: Ta witryna używa plików cookies. Pozostając na stronie akceptujesz naszą %@.

# INFO_REGULAMIN_HYPER_LINK
source: imoje terms and conditions
pl: Regulamin imoje

# INFO_COOKIE_HYPER_LINK
source: Cookie policy
pl: Politykę cookie

# INFO_PERSONAL_DATA_HYPER_LINK
source: imoje privacy information
pl: Informację o danych osobowych imoje

# INFO_TWISTO_REGULAMIN_HYPER_LINK
source: Twisto terms and conditions
pl: Regulamin formuły Twisto Pay

# INFO_TWISTO_PRIVACY_HYPER_LINK
source: Twisto privacy information
pl: Informację o danych osobowych

# INFO_HYPER_LINK_SPLIT
source: and
pl: oraz
